Repository: RPTools-org/controlTypeBeforeLabel
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: uk

source: Say control type before label
uk: Промовляти тип елемента керування перед міткою

source: A flexible add-on that allows NVDA to announces the type and state of the GUI controls before their label. The names of types and states can also be customized. The add-on supports checkboxes, radio buttons and checkable menu items.
uk: Гнучкий додаток, який дозволяє NVDA оголошувати тип і стан елементів керування графічним інтерфейсом перед їхніми мітками. Назви типів і станів також можна налаштовувати. Додаток підтримує прапорці, радіокнопки й пункти меню, які можна позначити.

source: stateBeforeCaption is the old name of controlTypeBeforeLabel. It will be replaced by this new version if you accept otherwise, the installation will be cancelled.
uk: stateBeforeCaption — стара назва controlTypeBeforeLabel. Її буде замінено на цю нову версію, якщо ви не погодитеся з цим, встановлення буде скасовано.

source: stateBeforeCaption detected
uk: Виявлено stateBeforeCaption

source: Attention : Change only the values after the equal symbols
uk: Увага: Змінюйте тільки значення після знака дорівнює

source: Then save and restart NVDA.
uk: Після цього збережіть налаштування й перезапустіть NVDA.

source: display settings dialog for the current profile
uk: показує діалог налаштувань для поточного профілю

source: Edit ini file of states and roles labels
uk: Редагувати ini-файл міток станів і ролей

source: Default
uk: Початково

source: Type State Label
uk: Тип мітка стану

source: State Label
uk: Мітка стану

source: &Say control type and state label by changing their name (better for Braille)
uk: Показувати текстом типи &елементів керування й мітки стану, змінивши їхні назви (краще для шрифту Брайля)

source: Select the format of the controls below :
uk: Виберіть формат елементів керування нижче:

source: &Checkboxes and radio buttons :
uk: &Прапорці й радіокнопки:

source: Check and radio &Menu items
uk: Елементи для позначення в &радіоменю

source: Error writing file :
uk: Помилка запису файлу :
